{
  "meta": {
    "title": "The Silent Estate",
    "intro_text": "The year is 1925. The wealthy industrialist Arthur Sterling has been found dead in his study.\nThree people were in the house.\n\nYou are the Detective. You have 30 turns to interrogate the suspects before the police arrive and take over the investigation.\n\nChoose your questions wisely. The suspects are sensitive and may clam up if you offend them.",
    "solution": {
      "killer": "Julian",
      "motive": "Gambling debts and impatience for inheritance."
    }
  },
  "outcomes": {
    "success": "You signal the officers. They surround Julian, who breaks down in tears, confessing everything.\n'I didn't mean to! He wouldn't give me the money! It was an accident!'\n\nThe Chief Inspector nods at you. 'Good work, Detective. The Silent Estate is silent once more.'\n\n[CASE CLOSED - SUCCESS]",
    "failure": "You point your finger, but your logic is flawed. The suspect has a solid alibi for that time.\nThe true killer slips away in the confusion.\n\nAs the police drag the wrong person away, you feel a cold breeze... the case will remain cold forever.\n\n[CASE CLOSED - FAILURE]",
    "timeout": "The sirens wail outside. The Chief Inspector bursts in.\n'Time is up, Detective! We are taking everyone downtown.'\n\nYou failed to identify the killer in time. Arthur Sterling's death will go unsolved.\n\n[CASE CLOSED - TIMEOUT]"
  },
  "suspects": [
    {
      "id": "butler",
      "name": "Alfred The Butler",
      "bio": "A nervous, twitchy man who has served the family for 30 years.",
      "personality_style": "formal_nervous",
      "is_guilty": false,
      "knowledge_sentences": [
        "I have served this family for 30 years as a loyal butler.",
        "I found the master's body in the study at 9:00 PM when I brought his tea.",
        "I was polishing the silver in the kitchen all evening, so I was working hard.",
        "At 8:30 PM, I stepped outside for a quick smoke break near the garden.",
        "I did not see anyone else enter or leave the study, the hallway was empty.",
        "I noticed the antique letter opener was missing from the desk yesterday.",
        "I admit, I was worried about my pension because nothing was in writing.",
        "Master Julian is reckless and has a terrible temper, he has been shouting for weeks.",
        "Ms. Veronica is a cold and terrifying woman, I saw her arguing with the master.",
        "I would never hurt the master, he was like family to me."
      ],
      "timeline": {
        "18:00": "At 6 PM? I was setting the table. I saw Ms. Veronica arguing with the master.",
        "19:00": "At 7 PM, I went to the kitchen to begin polishing the silver.",
        "20:00": "At 8 PM, I was still in the kitchen polishing the cutlery.",
        "20:30": "At 8:30... I stepped out to the garden for a quick smoke.",
        "21:00": "At 9 PM exactly, I brought the master his tea. That is when I found the body!",
        "22:00": "By 10 PM I was with the police, giving my official statement.",
        "23:00": "At 11 PM, I was sitting in the library, waiting for the inspector.",
        "00:00": "By midnight, I was sent to my quarters."
      },
      "prefixes": ["If I recall...", "Well...", "Let me think...", "To answer you..."],
      "suffixes": ["...and that is the truth.", "...I swear it.", "...believe me."],
      "defense_statement": "Oh heavens no! I could never hurt the master!",
      "fallback_statement": "I don't recall that specific detail."
    },
    {
      "id": "heir",
      "name": "Julian The Heir",
      "bio": "Arrogant, wealthy, and seemingly unbothered by the death.",
      "personality_style": "arrogant_dismissive",
      "is_guilty": true,
      "knowledge_sentences": [
        "I don't care that he is dead, the old man was sick and cruel.",
        "I was out at the Sapphire Club downtown drinking with friends.",
        "The bartender at the Sapphire Club can vouch for me, I was there all night.",
        "Okay, I came back to the house around 8:00 PM but I stayed in the garden.",
        "I waited in the garden because I wanted to ask him for money, but I lost my nerve.",
        "I assume I get the inheritance money now? It is about time I got my share.",
        "I owe some bad people a lot of money and I needed the cash to pay my gambling debts.",
        "I did not kill him! I don't touch sharp objects or weapons.",
        "If anyone is the killer, it is Veronica. She is a shark and wanted the company.",
        "Old Alfred is just annoying and twitchy, he has been stealing wine from the cellar."
      ],
      "timeline": {
        "18:00": "At 6 PM I was getting dressed. I heard Veronica yelling at my father.",
        "19:00": "I left for the Sapphire Club downtown. I needed a stiff drink.",
        "20:00": "At 8 PM? I... well, I told the police I was at the club.",
        "20:30": "Fine. At 8:30 I was in the garden. I wanted to ask for money, but I didn't go in.",
        "21:00": "I heard a scream from the house at 9 PM. I panicked and drove away.",
        "22:00": "I was back at the club by 10, trying to establish an alibi.",
        "23:00": "At 11 I was winning at poker. Or losing. I don't remember.",
        "00:00": "Midnight? I was still drinking."
      },
      "prefixes": ["Look...", "Fine...", "Whatever...", "Here is the truth...", "Ugh..."],
      "suffixes": ["...happy now?", "...you understand?", "...so stop asking.", "...got it?"],
      "defense_statement": "Don't be ridiculous. I have better things to do than get my hands dirty.",
      "fallback_statement": "What are you babbling about? Ask me about the money or the club."
    },
    {
      "id": "veronica",
      "name": "Veronica The Partner",
      "bio": "Sharp, cold, and calculated. A high-powered executive.",
      "personality_style": "cold_analytical",
      "is_guilty": false,
      "knowledge_sentences": [
        "This death is a tragedy, but mostly because it is bad for business.",
        "I was working on a conference call with Tokyo from 8:00 PM to 10:00 PM.",
        "I don't need his money, I have my own empire and fortune.",
        "We were partners, his death actually complicates the merger we were planning.",
        "I saw a letter opener on his desk earlier, it looked dangerous.",
        "That boy Julian is a disaster, he is drowning in gambling debt.",
        "Alfred the butler is a nervous wreck, he was terrified of losing his pension.",
        "The master had files on my offshore accounts and I wanted them back.",
        "I went to the study at 8:45 PM to get the files, but he was already dead.",
        "I was not angry with him, we were simply having a spirited business negotiation.",
        "I did not see anyone else enter the wing, it was completely quiet.",
        "I suspect Julian is the killer, he has the motive and the temper."
      ],
      "timeline": {
        "18:00": "I had a disagreement with the deceased regarding the merger terms.",
        "19:00": "I was preparing for my scheduled conference call in my room.",
        "20:00": "At 8 PM, I started the call in my guest room.",
        "20:45": "At 8:45, I took a brief break to go to the study. He was already dead.",
        "21:00": "At 9 PM I was back on the call. Professionalism is key.",
        "22:00": "I finished the call and went to see what the commotion was about.",
        "23:00": "I was reviewing the merger files in my room.",
        "00:00": "I was asleep."
      },
      "prefixes": ["Listen...", "The facts are...", "Logically speaking...", "To be precise..."],
      "suffixes": ["...check the logs.", "...that is my alibi.", "...does that clarify things?", "...simple as that."],
      "defense_statement": "Killing him would be a poor strategic move. I am innocent.",
      "fallback_statement": "That question is irrelevant to the business at hand."
    }
  ]
}